updated the readme file with better explaination
